TITLE ЛР_1 
;------------------------------------------------------------------------------
;ЛР  №1.1
;------------------------------------------------------------------------------
; Програмування 3. Системне програмування
; Завдання:              Основи розробки і налагодження
; ВУЗ:                  КНУУ "КПІ"
; Факультет:    ФІОТ
; Курс:                2
; Група:       __ __ __
;------------------------------------------------------------------------------
; Автор:        __ __ __
; Дата:         __/__/__
;---------------------------------
				;I.ЗАГОЛОВОК ПРОГРАМИ
IDEAL			; Директива - тип Асемблера tasm 
MODEL small		; Директива - тип моделі пам’яті 
STACK 256		; Директива - розмір стеку 
				;II.МАКРОСИ
				;III.ПОЧАТОК СЕГМЕНТУ ДАНИХ
DATASEG
exCode db 0     
message db "Hello world!",10,13,"Vlad Filonenko, Denis Davidenko, Nikita Krivoruk",10,13,'$';Рядок символів для виводу на екран
				;VI. ПОЧАТОК СЕГМЕНТУ КОДУ
CODESEG
Start:
;--------------------------------- 1. Ініціалізація DS и ES---------------------------------------
	mov cx,9	;Завантажуємо в регістер сх значення 9
	mov ax,@data	; @data ідентифікатор, що створюються директивою model
	mov ds, ax	; Завантаження початку сегменту даних в регістр ds
	mov es, ax	; Завантаження початку сегменту даних в регістр es
;----------------------------------2. Операція виводу на консоль---------------------------------
abc:	;місце в якому встановлена мітка для переходу
	; Пересилання адреси рядка символів message в регістр dx
	mov dx, offset message
			; Завантаження числа 09h до регістру ah
			; (Функція DOS 9h - команда виводу на консоль рядка)
	mov ah,09h
	int 21h		; Виклик функції DOS 9h
	
	LOOP abc	;Це інструкція LOOP яка зменшує значення в регістрі сх на 1; якщо в результаті сх != 0 відбувається перехід на мітку abc
	
;----------------------------------3. Операція зупинки програми, очікування натискання клавіш-----
	mov ah,01h
			; Завантаження числа 01h до регістру ah
			; (Функція DOS 1h - команда очікування натискання клавіші...)
	int 21h		; Виклик функції DOS 1h
			; Завантаження числа 4ch до регістру ah
			; (Функція DOS 4ch - виходу з програми)
;---------------------------------4. Вихід з програми---------------------------------------------
	mov ah,4ch
	mov al,[exCode]	; отримання коду виходу 
	int 21h		; виклик функції DOS 4ch
	end Start