TITLE LAB2
;------------------------------------------------------------------------------
;ЛР  №2
;------------------------------------------------------------------------------
; Програмування 3. Системне програмування
; Завдання:    	Основи розробки і налагодження
; ВУЗ:  		КНУУ "КПІ"
; Факультет:  	ФІОТ
; Курс: 		1
; Група:     	IT-03
; Команда: 		9
;------------------------------------------------------------------------------
; Дата:         _23_/_03_/_2021_

;----------------I.ЗАГОЛОВОК ПРОГРАМИ-----------------------
IDEAL			; Директива - тип Асемблера tasm 
MODEL small		; Директива - тип моделі пам’яті 
STACK 256		; Директива - розмір стеку 
;-----------------II.МАКРОСИ----------------------------------------
; Макрос для ініціалізації
MACRO M_Init		; Початок макросу 
mov	ax, @data		; ax <- @data
mov	ds, ax			; ds <- ax
mov	es, ax			; es <- ax
ENDM M_Init		; Кінець макросу

;--------------------III.ПОЧАТОК СЕГМЕНТУ ДАНИХ
DATASEG
exCode db 0
;----------------------VI. ПОЧАТОК СЕГМЕНТУ КОДУ-----------------
CODESEG
Start:	
M_Init
;----------- Variant 1. Symbols to senter 0 memory-------------------
							;Налаштування ES на сторінку 0 відеопамяті 
	mov AX, 0B800h 			; 1. Сегментна адреса початку відеопамяті   
	mov ES, AX 				; 2. До ES 
;---------------------1 Лінія-------------------------------------------	
	mov CX, 20   	; Цикл будет выполнен 20 раз
	mov BX, 324		; Зміщення центру eкрану 80*2*2+2*2
my_ptr:
			
	mov [word ES:BX], 0130h	    ; Симвл на экран 
	add BX, 2					;BX + 2, (324+2)-символ здвигається праворуч
	LOOP my_ptr        			; Повторить цикл
	
;---------------------2 Лінія-------------------------------------------
	mov CX, 20
	mov BX, 484					; Зміщення центру eкрану 80*2*3+2*2
my_ptr2:
			
	mov [word ES:BX], 1230h	    ; Симвл на экран 
	add BX, 2					
	LOOP my_ptr2 				; Повторить цикл
;---------------------3 Лінія-------------------------------------------
	mov CX, 20
	mov BX, 644					; 4. Зміщення центру eкрану 80*2*4+2*2
my_ptr3:

	mov [word ES:BX], 2330h	    
	add BX, 2
	LOOP my_ptr3 
;---------------------4 Лінія-------------------------------------------
	mov CX, 20
	mov BX, 804					; 4. Зміщення центру eкрану 80*2*5+2*2
my_ptr4:
			
	mov [word ES:BX], 3430h	    
	add BX, 2
	LOOP my_ptr4 
;---------------------5 Лінія-------------------------------------------
	mov CX, 20
	mov BX, 964					; 4. Зміщення центру eкрану 80*2*6+2*2
my_ptr5:
		
	mov [word ES:BX], 4530h	    
	add BX, 2
	LOOP my_ptr5 
;---------------------6 Лінія-------------------------------------------
	mov CX, 20
	mov BX, 1124				; 4. Зміщення центру eкрану 80*2*7+2*2
my_ptr6:
			
	mov [word ES:BX], 5630h	
	add BX, 2   ; Сместить координаты
	LOOP my_ptr6 
;---------------------7 Лінія-------------------------------------------
	mov CX, 20
	mov BX, 1284				; 4. Зміщення центру eкрану 80*2*8+2*2
my_ptr7:
			
	mov [word ES:BX], 6130h	    
	add BX, 2
	LOOP my_ptr7 
;---------------------8 Лінія-------------------------------------------
	mov CX, 20
	mov BX, 1444				; 4. Зміщення центру eкрану 80*2*9+2*2
my_ptr8:
		
	mov [word ES:BX], 8240h	    
	add BX, 2	
	LOOP my_ptr8 
;---------------------9 Лінія-------------------------------------------
	mov CX, 20
	mov BX, 1604				; 4. Зміщення центру eкрану 80*2*10+2*2
my_ptr9:
		
	mov [word ES:BX], 8130h	    
	add BX, 2
	LOOP my_ptr9 
;---------------------10 Лінія-------------------------------------------
	mov CX, 20
	mov BX, 1764				; 4. Зміщення центру eкрану 80*2*11+40*2
my_ptr10:
			
	mov [word ES:BX], 9130h	    
	add BX, 2
	LOOP my_ptr10 
;---------------------Вихід з програми-------------------------------------------
Exit:
     mov ah,4ch
     mov al,[exCode]; отримання коду виходу 
     int 21h		; виклик функції DOS 4ch
    end Start